// Задача 1.
// Напишите цикл, который выводит числа от 1 до 20, но пропускает те числа, которые делятся на 4 без остатка.

// for (let number = 0; number <= 20; number++) {
//   if (number % 4 !== 0) {
//     console.log(number);
//   }
// }

// Задача 2.
// С помощью цикла for вычислите факториал числа (произведение всех чисел от 1 до заданного числа). Используйте prompt для получение начального значения.

// const number = +prompt("Введите число");

// if (number === 0) {
//   alert("Факториал 0 равен 1");
// } else {
//   let sum = 1;
//   for (let i = 1; i <= number; i++) {
//     sum = sum * i;
//   }
//   alert(`Факториал ${number} = ${sum}`);
// }

// *Задача 3.
// Выведите в консоль шахматную доску размером 8x8, где символы чередуются (например, # и пробел). Начинайте с # в первой ячейке первой строки.

//  Не понимаю если честно знаю что надо через ИИ но меня так не устраивает поэтому пропускаю лучше послушаю как сделали
